Courses/7140/Lectures/SecureProg/PL-Security-CPP/secureCCpp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Secure Programming in C/ C++</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Secure Programming in C/ C++"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-11-05T01:01-0500"/>
<meta name="author" content="Prabhaker Mateti"/>
<meta name="description" content="CS7140 Software Engineering Lecture"/>
<meta name="keywords" content=""/>




</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../Lectures"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Secure Programming in C/ C++</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Buffer Overflow + Smashing The Stack</a></li>
<li><a href="#sec-2">2 Code Analysis Tools and Run-time Protection</a></li>
<li><a href="#sec-3">3 References</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Buffer Overflow + Smashing The Stack</h2>
<div class="outline-text-2" id="text-1">


<ol>
<li>Prabhaker Mateti, "Buffer Overflow",
   <a href="http://www.cs.wright.edu/~pmateti/">http://www.cs.wright.edu/~pmateti/</a> InternetSecurity/ Lectures/
   BufferOverflow/, 2012.  (This article not the embedded Aleph One
   article) Required Reading.

</li>
<li>Secure Programming for Linux and Unix HOWTO &ndash; Creating Secure Software
   <a href="http://www.dwheeler.com/secure-programs/">http://www.dwheeler.com/secure-programs/</a>  2003.  Reference

</li>
<li>Ulfar Erlingsson, Yves Younan, and Frank Piessens "Low-Level
   Software Security by Example" 2008 Chapter 30 Low-Level Sofware
   Security by Example.pdf URL TBD  Recommended Reading
</li>
</ol>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Code Analysis Tools and Run-time Protection</h2>
<div class="outline-text-2" id="text-2">

<ol>
<li>Splint for C
</li>
<li>RatScan 6 (a graphical front end to RATS)
</li>
<li>Coverity.com
</li>
<li>CodeSonar 7 from Grammatech
</li>
<li>en.wikipedia.org List-of-tools-for-static-code-analysis
</li>
<li>Gary McGraw, "Automated Code Review Tools for Security", IEEE
   Computer, Dec 2008, pp 92-95.  PDF accessible via WSU Library
   proxy.  Required Reading.
</li>
<li><a href="http://cwe.mitre.org/cwss/">Common Weakness Scoring System</a> Recommended Reading.
</li>
</ol>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> References</h2>
<div class="outline-text-2" id="text-3">


<ol>
<li>[Book] Introduction to Computer Security, Michael Goodrich, University
   of California, Irvine Roberto Tamassia, Brown University, Addison
   Wesley, 2011.  Reference

</li>
<li>Robert C. Seacord, Secure Coding in C and C++, 600 pages,
   Addison-Wesley Professional; 2 edition, 2013
   Recommended Reading.
</li>
</ol>


</div>
</div>
</div>

<div id="postamble">
<hr size=1>Copyright &copy; 2013 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="www.wright.edu/~pmateti">www.wright.edu/~pmateti</a>
</div>
</body>
</html>
